bscoventry/Chronos_nRF54/Firmware/src/spi.c
#include <nrfx_spim.h>
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <hal/nrf_gpio.h>
#include <string.h>
#include "spi.h"
#include "config.h"

static nrfx_spim_t spim_inst = NRFX_SPIM_INSTANCE(SPIM_INST_IDX);
static void spim_handler(nrfx_spim_evt_t const * p_event, void * p_context);
uint8_t dac1_buf_tx[DAC_TX_LEN] = {0x52, 0x53};
uint8_t dac2_buf_tx[DAC_TX_LEN] = {0x54, 0x55};
uint8_t dac1_buf_rx[DAC_RX_LEN];
uint8_t dac2_buf_rx[DAC_RX_LEN];
void update_dac1_amplitude(uint16_t amplitude) {
    dac1_buf_tx[0] = (amplitude >> 8) & 0xFF;  // MSB
    dac1_buf_tx[1] = amplitude & 0xFF;         // LSB

    printf("DAC1 amplitude updated to %u (0x%02X 0x%02X)\n",
           amplitude, dac1_buf_tx[0], dac1_buf_tx[1]);
}

void update_dac2_amplitude(uint16_t amplitude) {
    uint16_t opposite_amplitude;
    if (amplitude == 0x0000) {
        opposite_amplitude = 0xFFFF;  // Most negative → Most positive
    } else {
        opposite_amplitude = (uint16_t)(0x10000UL - amplitude);
    }

    dac2_buf_tx[0] = (opposite_amplitude >> 8) & 0xFF;  // MSB
    dac2_buf_tx[1] = opposite_amplitude & 0xFF;         // LSB

    printf("DAC2 amplitude updated to opposite of %u: %u (0x%02X 0x%02X)\n",
           amplitude, opposite_amplitude, dac2_buf_tx[0], dac2_buf_tx[1]);
}

void cs_select(uint32_t pin_number) {
    nrf_gpio_pin_clear(pin_number);  // Drive CS low (active)
}

void cs_deselect(uint32_t pin_number) {
    nrf_gpio_pin_set(pin_number);     // Drive CS high (inactive)
}

void spi_write_dac1(uint8_t *tx_data, uint8_t *rx_data) {
    cs_select(DAC1_CS_PIN);
    memset(rx_data, 0, DAC_RX_LEN);
    nrfx_spim_xfer_desc_t xfer_desc = NRFX_SPIM_XFER_TRX(tx_data, DAC_TX_LEN, rx_data, DAC_RX_LEN);
    nrfx_err_t err = nrfx_spim_xfer(&spim_inst, &xfer_desc, 0);
    if (err != NRFX_SUCCESS) {
        printf("SPI ERROR\n");
    }
    for (volatile uint32_t i = 0; i < SPI_CS_HOLD_DELAY_LOOPS; i++) {
        (void)i;
    }
    cs_deselect(DAC1_CS_PIN);
}

void spi_write_dac2(uint8_t *tx_data, uint8_t *rx_data) {
    cs_select(DAC2_CS_PIN);
    memset(rx_data, 0, DAC_RX_LEN);
    nrfx_spim_xfer_desc_t xfer_desc = NRFX_SPIM_XFER_TRX(tx_data, DAC_TX_LEN, rx_data, DAC_RX_LEN);
    nrfx_err_t err = nrfx_spim_xfer(&spim_inst, &xfer_desc, 0);
    if (err != NRFX_SUCCESS) {
        printf("SPI ERROR\n");
    }
    for (volatile uint32_t i = 0; i < SPI_CS_HOLD_DELAY_LOOPS; i++) {
        (void)i;
    }
    cs_deselect(DAC2_CS_PIN);
}
void spi_init(){
    nrfx_spim_config_t spim_config = NRFX_SPIM_DEFAULT_CONFIG(SCK_PIN,
                                                              MOSI_PIN,
                                                              MISO_PIN,
                                                              NRF_SPIM_PIN_NOT_CONNECTED);

    spim_config.frequency = 2000000;
    nrfx_err_t status = nrfx_spim_init(&spim_inst, &spim_config, spim_handler, NULL);
    if (status == NRFX_SUCCESS) {
        printf("SPI initialized successfully on SPIM%d\n", SPIM_INST_IDX);
        printf("  SCK: P%d.%02d\n", (SCK_PIN >> 5), (SCK_PIN & 0x1F));
        printf("  MOSI: P%d.%02d\n", (MOSI_PIN >> 5), (MOSI_PIN & 0x1F));
        printf("  MISO: P%d.%02d\n", (MISO_PIN >> 5), (MISO_PIN & 0x1F));
    } else {
        printf("SPI initialization failed with error: %d\n", status);
    }
}

static void spim_handler(nrfx_spim_evt_t const * p_event, void * p_context){
    if ((p_event->type == NRFX_SPIM_EVENT_DONE)&& (SPI_VERBOSE == 1)){
        printf("Message received: %02X\n", p_event->xfer_desc.p_rx_buffer);
    }
}
